# =============================================================================
# Railroad Language File - Spanish (es_es)
# =============================================================================

# =============================================================================
# GENERIC/COMMON
# =============================================================================
railroad.generic.apply=Aplicar
railroad.generic.ok=Ok
railroad.generic.cancel=Cancelar
railroad.generic.close=Cerrar
railroad.generic.back=Volver
railroad.generic.next=Siguiente
railroad.generic.finish=Finalizar

# =============================================================================
# APPLICATION
# =============================================================================
railroad.app.name=Railroad
railroad.app.version=1.0.0 (dev)

# =============================================================================
# WINDOW TITLES
# =============================================================================
railroad.home.window.title=Railroad
railroad.ide.window.title=Railroad IDE

# =============================================================================
# HOME/WELCOME SCREEN
# =============================================================================
railroad.home.welcome.greeting=¡Bienvenido a Railroad!
railroad.home.welcome.projects=Lista de proyectos
railroad.home.welcome.projects.subtitle=Gestiona tus proyectos con facilidad
railroad.home.welcome.projects.empty=¡Aún no hay proyectos! Crea tu primer proyecto.
railroad.home.welcome.projectsearch=Buscar proyectos...
railroad.home.welcome.projectsearch.subtitle=Buscar proyectos
railroad.home.welcome.home=Inicio
railroad.home.welcome.openproject=Abrir proyecto
railroad.home.welcome.newproject=Nuevo proyecto
railroad.home.welcome.importproject=Importar proyecto
railroad.home.welcome.settings=Configuración

# Project sorting
railroad.home.welcome.sort.none=Ninguno
railroad.home.welcome.sort.name=Nombre
railroad.home.welcome.sort.date=Fecha

# Project actions
railroad.home.welcome.project.open=Abrir
railroad.home.welcome.project.remove=Eliminar
railroad.home.welcome.project.searchtype=Buscar tipos de proyectos

# =============================================================================
# SETTINGS
# =============================================================================
railroad.home.settings.title=Configuración
railroad.home.settings.description=Configura tus ajustes aquí.
railroad.home.settings.search=Buscar configuración...
railroad.home.settings.back=Volver

# Settings categories
railroad.general=General
railroad.appearance=Apariencia
railroad.ide=IDE

# General settings
railroad.general.language.title=Idioma
railroad.general.language.description=Selecciona el idioma para la interfaz de Railroad.
railroad.general.project_folder.title=Carpeta de proyecto por defecto

# GitHub connection
railroad.home.settings.general.github=Conexión a Github:
railroad.home.settings.general.github.connect=Conectar
railroad.home.settings.general.github.disconnect=Desconectar

# Appearance settings
railroad.appearance.themes=Temas
railroad.appearance.themes.description=Personaliza la apariencia de Railroad seleccionando entre temas disponibles o descargando nuevos desde el repositorio de temas.
railroad.appearance.themes.download_repo.title=Repositorio personalizado
railroad.appearance.themes.download_repo.description=Especifica una URL de repositorio de GitHub para descargar temas.
railroad.appearance.themes.select.title=Tema
railroad.appearance.themes.select.description=
railroad.appearance.language.language.title=Idioma

# Theme management
railroad.home.settings.appearance.theme=Seleccionar un tema
railroad.home.settings.appearance.downloadtheme=Descargar temas
railroad.home.settings.appearance.downloadtheme.description=Explora y descarga temas desde el repositorio oficial de temas de Railroad.
railroad.home.settings.appearance.notfound=Temas no encontrados
railroad.home.settings.appearance.loading=Cargando temas...
railroad.home.settings.appearance.themes=Temas disponibles
railroad.home.settings.appearance.themes.found=%d temas encontrados
railroad.home.settings.appearance.download=Descargar
railroad.home.settings.appearance.installed=Instalado
railroad.home.settings.appearance.preview=Vista previa
railroad.home.settings.appearance.preview.error=Error al cargar vista previa
railroad.home.settings.appearance.preview.loaded=Vista previa cargada
railroad.home.settings.appearance.selecttheme=Seleccionar tema

# Theme preview
railroad.home.settings.appearance.preview.title=Vista previa del tema
railroad.home.settings.appearance.preview.subtitle=Esta vista previa muestra cómo se verán varios componentes de la interfaz de usuario con el tema seleccionado.
railroad.home.settings.appearance.preview.form.components=Componentes de formulario
railroad.home.settings.appearance.preview.list.components=Componentes de lista
railroad.home.settings.appearance.preview.button.components=Componentes de botón
railroad.home.settings.appearance.preview.close=Cerrar vista previa
railroad.home.settings.appearance.preview.apply=Aplicar tema

# Keymaps
railroad.home.settings.keymaps.key=Tecla
railroad.home.settings.keymaps.action=Acción
railroad.home.settings.keymaps.action.runproject=Ejecutar proyecto
railroad.home.settings.keymaps.action.termproject=Terminar proyecto

# IDE settings
railroad.ide.auto_pair_inside_strings.title=Auto-emparejamiento dentro de cadenas
railroad.ide.auto_pair_inside_strings.description=Habilitar o deshabilitar el auto-emparejamiento de corchetes y comillas dentro de cadenas.

# =============================================================================
# PROJECT CREATION
# =============================================================================
railroad.home.project=Proyecto
railroad.home.project.browse=Examinar
railroad.home.project.create=Crear
railroad.home.project.creating=Creando proyecto...

# Project basic info
railroad.project.creation.name=Nombre
railroad.project.creation.name.prompt=Ingresa el nombre del proyecto
railroad.project.creation.name.error.required=Debes ingresar un nombre de proyecto
railroad.project.creation.name.error.length_long=El nombre del proyecto es demasiado largo
railroad.project.creation.name.error.length_short=El nombre del proyecto es demasiado corto
railroad.project.creation.name.error.invalid_characters=El nombre del proyecto contiene caracteres inválidos

railroad.project.creation.location=Ubicación
railroad.project.creation.location.error.required=Debes ingresar una ubicación de proyecto
railroad.project.creation.location.error.invalid_characters=La ubicación del proyecto contiene caracteres inválidos
railroad.project.creation.location.error.not_exists=La ubicación del proyecto no existe
railroad.project.creation.location.error.not_directory=La ubicación del proyecto no es un directorio
railroad.project.creation.location.error.invalid_path=La ubicación del proyecto es inválida
railroad.project.creation.location.warning.onedrive=No se recomienda crear proyectos en OneDrive ya que tiende a causar problemas.
railroad.project.creation.location.info=Esto se creará en: %s

railroad.project.creation.git=Crear repositorio Git

railroad.project.creation.license=Licencia
railroad.project.creation.license.custom=Licencia personalizada
railroad.project.creation.license.custom.prompt=Ingresa licencia personalizada
railroad.project.creation.license.custom.error.required=Debes ingresar una licencia personalizada

# Minecraft settings
railroad.project.creation.minecraft_version=Versión de Minecraft
railroad.project.creation.forge_version=Versión de Forge
railroad.project.creation.fabric_loader_version=Versión del cargador de Fabric
railroad.project.creation.include_fapi=Incluir API de Fabric
railroad.project.creation.fabric_api_version=Versión de API de Fabric

# Mod settings
railroad.project.creation.mod_id=ID del mod
railroad.project.creation.mod_id.prompt=Ingresa ID del mod
railroad.project.creation.mod_id.error.required=Debes ingresar un ID de mod
railroad.project.creation.mod_id.error.length_short=El ID del mod es demasiado corto
railroad.project.creation.mod_id.error.length_long=El ID del mod es demasiado largo
railroad.project.creation.mod_id.error.invalid_characters=El ID del mod contiene caracteres inválidos

railroad.project.creation.mod_name=Nombre del mod
railroad.project.creation.mod_name.prompt=Ingresa nombre del mod
railroad.project.creation.mod_name.error.required=Debes ingresar un nombre de mod
railroad.project.creation.mod_name.error.length_long=El nombre del mod es demasiado largo

railroad.project.creation.main_class=Clase principal
railroad.project.creation.main_class.prompt=Ingresa el nombre de la clase principal
railroad.project.creation.main_class.error.required=Debes ingresar el nombre de la clase principal
railroad.project.creation.main_class.error.invalid_characters=El nombre de la clase principal contiene caracteres inválidos

# Project features
railroad.project.creation.use_mixins=Usar Mixins
railroad.project.creation.use_access_transformer=Usar Access Transformer
railroad.project.creation.use_access_widener=Usar Access Widener
railroad.project.creation.gen_run_folders=Generar carpetas de ejecución
railroad.project.creation.split_sources=Dividir fuentes

# Mappings
railroad.project.creation.mapping_channel=Canal de mapeo
railroad.project.creation.mapping_version=Versión de mapeo

# Project metadata
railroad.project.creation.author=Autor
railroad.project.creation.author.prompt=Ingresa nombre del autor
railroad.project.creation.author.error.length_long=El nombre del autor es demasiado largo

railroad.project.creation.credits=Créditos
railroad.project.creation.credits.prompt=Ingresa créditos
railroad.project.creation.credits.error.length_long=Los créditos son demasiado largos

railroad.project.creation.description=Descripción
railroad.project.creation.description.prompt=Ingresa descripción
railroad.project.creation.description.error.length_long=La descripción es demasiado larga

# URLs
railroad.project.creation.issues=URL de problemas
railroad.project.creation.issues.prompt=Ingresa URL de problemas
railroad.project.creation.issues.error.length_long=La URL de problemas es demasiado larga
railroad.project.creation.issues.error.invalid_url=La URL de problemas es inválida

railroad.project.creation.update_json_url=URL de actualización JSON
railroad.project.creation.update_json_url.prompt=Ingresa URL de actualización JSON
railroad.project.creation.update_json_url.error.length_long=La URL de actualización JSON es demasiado larga
railroad.project.creation.update_json_url.error.invalid_url=La URL de actualización JSON es inválida

railroad.project.creation.display_url=URL de visualización
railroad.project.creation.display_url.prompt=Ingresa URL de visualización
railroad.project.creation.display_url.error.length_long=La URL de visualización es demasiado larga
railroad.project.creation.display_url.error.invalid_url=La URL de visualización es inválida

railroad.project.creation.homepage=URL de página de inicio
railroad.project.creation.homepage.prompt=Ingresa URL de página de inicio
railroad.project.creation.homepage.error.length_long=La URL de página de inicio es demasiado larga
railroad.project.creation.homepage.error.invalid_url=La URL de página de inicio es inválida

railroad.project.creation.sources=URL de fuentes
railroad.project.creation.sources.prompt=Ingresa URL de fuentes
railroad.project.creation.sources.error.length_long=La URL de fuentes es demasiado larga
railroad.project.creation.sources.error.invalid_url=La URL de fuentes es inválida

# Project options
railroad.project.creation.display_test=Prueba de visualización
railroad.project.creation.client_side_only=Solo lado cliente

# Maven settings
railroad.project.creation.group_id=ID del grupo
railroad.project.creation.group_id.prompt=Ingresa ID del grupo
railroad.project.creation.group_id.error.required=Debes ingresar un ID de grupo
railroad.project.creation.group_id.error.length_long=El ID del grupo es demasiado largo
railroad.project.creation.group_id.error.invalid_characters=El ID del grupo contiene caracteres inválidos

railroad.project.creation.artifact_id=ID del artefacto
railroad.project.creation.artifact_id.prompt=Ingresa ID del artefacto
railroad.project.creation.artifact_id.error.required=Debes ingresar un ID de artefacto
railroad.project.creation.artifact_id.error.length_long=El ID del artefacto es demasiado largo
railroad.project.creation.artifact_id.error.invalid_characters=El ID del artefacto contiene caracteres inválidos

railroad.project.creation.version=Versión
railroad.project.creation.version.prompt=Ingresa versión
railroad.project.creation.version.error.required=Debes ingresar una versión
railroad.project.creation.version.error.length_long=La versión es demasiado larga
railroad.project.creation.version.error.invalid_characters=La versión contiene caracteres inválidos

# Project creation sections
railroad.project.creation.section.project=Proyecto
railroad.project.creation.section.minecraft=Minecraft
railroad.project.creation.section.optional=Opcional
railroad.project.creation.section.mappings=Mapeos
railroad.project.creation.section.maven=Maven

# =============================================================================
# IDE
# =============================================================================
railroad.ide.welcome.message=¡Bienvenido a Railroad!
railroad.ide.welcome.message.description=Para comenzar, crea un nuevo archivo o abre uno existente.
railroad.ide.welcome.features=Características

railroad.ide.welcome.feature.model_viewer_editor=Visor y editor de modelos
railroad.ide.welcome.feature.structure_viewer_editor=Visor y editor de estructuras
railroad.ide.welcome.feature.texture_viewer_editor=Visor y editor de texturas
railroad.ide.welcome.feature.sound_visualizer=Visualizador de sonido
railroad.ide.welcome.feature.mixin_support=Soporte de Mixin

railroad.ide.welcome.getting_started=Primeros pasos
railroad.ide.welcome.getting_started.description=Aprende a usar Railroad con nuestra wiki y tutoriales.
railroad.ide.welcome.getting_started.wiki=Wiki
railroad.ide.welcome.getting_started.tutorials=Tutoriales

railroad.ide.project_explorer.search_field=Buscar archivos...

# =============================================================================
# DIALOGS
# =============================================================================
railroad.dialog.open_project.title=Abrir Proyecto
railroad.dialog.open_project.error.invalid_directory=Directorio de Proyecto Inválido
railroad.dialog.open_project.error.invalid_directory.message=El directorio seleccionado no parece ser un proyecto válido. Por favor selecciona un directorio que contenga un proyecto válido.
